%%% Практика
%% 3. Аналіз каналу
%% 3.1. а) Розрахунок пропускної здатності неперервного гаусового каналу
%% Вхідні дані цифрового каналу згідно намеру варіанта
N = 12;               % номер по списку
n = 2;                % номер групи (1 або 2)
Nvar = N + 12;       % номер варіанту 2 групи
W = Nvar              % ширина смуги пропускання
Rb = Nvar             % бітова швидкість
Tb = 1/Rb             % тривалість біта
%% Розрахунок пропускної здатності неперервного гаусового каналу
EbNodB = (1/4) * Nvar + 5  % відношення енергії біта до спектральної густини потужності
Cawgn = W .* log2(1 + (10.^(0.1 .* EbNodB)) .* Rb ./ W)
%Cawgn = W .* log2(1 + (10 .^(0.1 .* EbNodB)) .* Cawgn ./ W)
plot(EbNodB,Cawgn,'ok'); grid on; hold on

%% Графік граничної пропускної здатності від EbNo при заданій ширині смуги
%% частоти
EbNo = [0 : 1: 10];
Cawgn = W .* log2(1 + (10.^(0.1 .* EbNo)) .* (Rb ./ W));
%Cawgn = W .* log2(1 + (10.^(0.1 .* EbNo)) .* (Cawgn ./ W));
plot(EbNo,Cawgn); grid on
xlabel('Eb/No, дБ'); ylabel('Cawgn, біт/с');

%% б) Розрахунок пропускної здатності для дискретного каналу.
M = 4;
%Rb = 19; Rs = Rb ./log2(M);
% 1) без кодування
Pber = 0.01479;
Cduskr = Rb * (log2(M) + Pber*log2(Pber/(M-1)) + (1-Pber)*log2(1-Pber))
% 2) з кодуванням
Pber_cod = 0.00003258;
Cduskr_cod = Rb * (log2(M) + Pber_cod*log2(Pber_cod/(M-1)) + (1-Pber_cod)*log2(1-Pber_cod))

%% 3.3. Розрахунок відношення MSI, S/N.
a = 1;
b = 0.3;
MSI = 20 .* log10(a ./ b)
SN = 20 .* log10(a ./ (a-b))
%% 3.4. Розрахунок ширини смуги пропускання частоти.
